
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Запрос = Новый Запрос;
		Запрос.Текст =
				"ВЫБРАТЬ
				|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Остаток
				|ИЗ
				|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Период, Номенклатура = &Номенклатура И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаТовары.Товар);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ТекущийОстаток = 0;
		Если Выборка.Следующий() Тогда
			ТекущийОстаток = Выборка.Остаток;
		КонецЕсли;
		
		Если ТекСтрокаТовары.Количество > ТекущийОстаток Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостаточно товара " + ТекСтрокаТовары.Товар + "! На складе: " + ТекущийОстаток + ", требуется: " + ТекСтрокаТовары.Количество;
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
			Возврат;
	КонецЕсли;
		
	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Контрагент = Контрагент;
		Движение.Выручка = ТекСтрокаТовары.Сумма;
		Движение.СуммаНалога = ТекСтрокаТовары.Сумма * 0.20;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр ОборотыПродаж 
	Движения.ОборотыПродаж.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОборотыПродаж.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.СуммаПокупок = ТекСтрокаТовары.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
