#Область ПриНачалеРаботы
Перем Пользователь Экспорт;
Перем Авторизация Экспорт;

&НаСервере
Процедура ПриНачалеРаботыСистемы() Экспорт
	Пользователь=ПользователиИнформационнойБазы.ТекущийПользователь();
	Если Строка(Пользователь.Имя)="ТекущийПользователь" Тогда
		
		Форма=ПолучитьФорму("ОбщаяФорма.ФормаАвторизации1").ОткрытьМодально();
	Иначе
		Форма=ПолучитьФорму("ОбщаяФорма.ФормаАвторизации2");
		Форма.Пользователь=Пользователь.Имя;
		Форма.ОткрытьМодально();
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры



#КонецОбласти